{
  "project": "D&D Character Sheet",
  "branchName": "ralph/subclass-overhaul",
  "description": "Comprehensive Subclass System Overhaul - Enforce subclass selection at level 3, auto-add subclass spells, show descriptions during selection",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add subclass spell data to class definitions",
      "description": "As a developer, I need subclass spell data stored in the class definitions so the app can auto-grant spells.",
      "acceptanceCriteria": [
        "Add `spells?: { level: number; spells: string[] }[]` field to Subclass interface in src/types/index.ts",
        "Add Cleric domain spells for Life, Light, Trickery, War (levels 3, 5, 7, 9) in src/data/classes.ts",
        "Add Warlock patron spells for Fiend, Great Old One, Celestial (levels 3, 5, 7, 9)",
        "Add Paladin oath spells for Devotion, Vengeance (levels 3, 5, 9, 13, 17)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added SubclassSpellGrant interface to classes.ts. Added spells to Cleric domains (Life, Light, Trickery, War), Warlock patrons (Archfey, Celestial, Fiend, Great Old One), and Paladin oaths (Devotion, Glory, Ancients, Vengeance)."
    },
    {
      "id": "US-002",
      "title": "Add Druid and Ranger subclass spells",
      "description": "As a developer, I need Druid circle spells and Ranger conclave spells in the class definitions.",
      "acceptanceCriteria": [
        "Add Druid circle spells for Moon, Sea (levels 3, 5, 7, 9)",
        "Add Ranger subclass spells for Gloom Stalker, Fey Wanderer (levels 3, 5, 9, 13, 17)",
        "Hunter and Beast Master have no subclass spells (verify no spells field needed)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Added spells to Circle of Moon, Circle of Sea, Fey Wanderer, and Gloom Stalker. Hunter and Beast Master verified to have no subclass spells per PHB 2024."
    },
    {
      "id": "US-003",
      "title": "Add missing subclass spells to spells database",
      "description": "As a developer, I need all subclass-granted spells to exist in the spells database.",
      "acceptanceCriteria": [
        "Check Cleric domain spells exist in SPELLS array, add any missing",
        "Check Warlock patron spells exist, add any missing",
        "Check Paladin oath spells exist, add any missing (Steel Wind Strike, etc.)",
        "Check Druid/Ranger spells exist, add any missing",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added 26 missing spells: Bane, Heroism, Shield of Faith, Detect Thoughts, Phantasmal Force, Rope Trick, Beacon of Hope, Blink, Clairvoyance, Daylight, Fear, Nondetection, Stinking Cloud, Water Breathing, Fount of Moonlight, Commune, Conjure Elemental, Geas, Insect Plague, Legend Lore, Mislead, Modify Memory, Scrying, Seeming, Summon Celestial, Yolande's Regal Presence."
    },
    {
      "id": "US-004",
      "title": "Create SubclassPickerModal component",
      "description": "As a developer, I need a reusable modal for selecting subclass during level-up.",
      "acceptanceCriteria": [
        "Create SubclassPickerModal component in src/components/",
        "Props: characterClass, onConfirm, onCancel",
        "Shows all subclasses for the class with name and description",
        "Shows subclass spells list if applicable",
        "Confirm button disabled until selection made",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Created SubclassPickerModal with expandable subclass cards showing name, description, features, and spells. Uses radio button selection pattern. Browser verification pending - will be verified when integrated in US-005."
    },
    {
      "id": "US-005",
      "title": "Prompt for subclass selection during level-up to level 3",
      "description": "As a player, when I level up to level 3, I want to be prompted to choose my subclass.",
      "acceptanceCriteria": [
        "During level-up from 2->3, show SubclassPickerModal after HP roll",
        "Selection is required - cannot proceed without choosing",
        "Selected subclass is saved to character.subclass",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Integrated SubclassPickerModal into level-up flow. Shows after HP roll when leveling to 3. Cancel button cancels entire level-up (subclass is required). Subclass is applied in completeLevelUp."
    },
    {
      "id": "US-006",
      "title": "Auto-add subclass spells when subclass is chosen",
      "description": "As a player, when I choose my subclass, I want the subclass-granted spells to be automatically added.",
      "acceptanceCriteria": [
        "Create helper function getSubclassSpellsForLevel(className, subclassName, level) in calculations.ts",
        "When subclass is selected, get subclass spells for current level",
        "Add spells to character.spells with source: 'Subclass'",
        "Don't add duplicates if spell already exists",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Created getSubclassSpellsForLevel and getSubclassSpellsForLevelUp functions. Integrated into completeLevelUp - when subclass is newly chosen, gets all spells up to current level. Spells have source: 'Subclass' and notes: 'Always prepared'."
    },
    {
      "id": "US-007",
      "title": "Auto-add subclass spells during level-up",
      "description": "As a player, when I level up and my subclass grants new spells, I want them automatically added.",
      "acceptanceCriteria": [
        "During level-up in completeLevelUp, check if new level grants subclass spells",
        "Add newly available subclass spells to character.spells with source: 'Subclass'",
        "Works for Cleric, Warlock, Paladin, Druid, Ranger",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Already implemented in US-006. The completeLevelUp function uses character.subclass for existing subclasses and compares character.level to new level to get newly available spells."
    },
    {
      "id": "US-008",
      "title": "Display subclass spells distinctly in spell list",
      "description": "As a player, I want to see which spells are from my subclass so I know they're always prepared.",
      "acceptanceCriteria": [
        "Spells with source: 'Subclass' show badge (e.g., 'Domain' or 'Always Prepared')",
        "Subclass spells cannot be removed (remove button hidden for these spells)",
        "Tooltip explains 'This spell is granted by your subclass and is always prepared'",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Added amber 'Always Prepared' badge for subclass spells with tooltip. Remove button hidden for both Subclass and Lineage spells."
    },
    {
      "id": "US-009",
      "title": "Validate existing characters need subclass at level 3+",
      "description": "As a player with an existing level 3+ character without a subclass, I want to be prompted to select one.",
      "acceptanceCriteria": [
        "When loading character sheet, check if level >= 3 and subclass is empty",
        "If missing, show SubclassPickerModal automatically",
        "Cannot dismiss modal without selecting",
        "After selection, save character and apply subclass spells",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Added useEffect to detect L3+ characters without subclass. Added isRequiredSubclassSelection state to track context. Cancel does nothing when required. handleRequiredSubclassConfirm applies subclass and spells."
    },
    {
      "id": "US-010",
      "title": "Add subclass to level-up summary",
      "description": "As a player, I want the level-up summary to show my subclass choice and new subclass spells.",
      "acceptanceCriteria": [
        "LevelUpSummaryModal shows 'Subclass: [Name]' if chosen this level",
        "Shows new subclass spells granted at this level",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Added selectedSubclass and newSubclassSpells props to LevelUpSummaryModal. Shows purple 'Subclass Chosen' section when selecting new subclass, amber 'New Subclass Spells' for level-up grants."
    }
  ]
}
